Revit 2027 API
BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInAnotherDesignOptionWarn Property
 A sweep in a Design Option cannot be hosted by an element in another Design Option [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConfusingSweepByElementsInAnotherDesignOptionWarn { get; }
Public Shared ReadOnly Property ConfusingSweepByElementsInAnotherDesignOptionWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConfusingSweepByElementsInAnotherDesignOptionWarn {
	FailureDefinitionId^ get ();
}
static member ConfusingSweepByElementsInAnotherDesignOptionWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace